/**
  ******************************************************************************
  * 文件名程: bsp_28BYJ48.c 
  * 作    者: 硬石嵌入式开发团队
  * 版    本: V1.0
  * 编写日期: 2015-10-04
  * 功    能: 步进电机底层驱动(ULN2003)程序
  ******************************************************************************
  * 说明：
  * 本例程配套硬石stm32开发板YS-F1Pro使用。
  * 
  * 淘宝：
  * 论坛：http://www.ing10bbs.com
  * 版权归硬石嵌入式开发团队所有，请勿商用。
  ******************************************************************************
  */

/* 包含头文件 ----------------------------------------------------------------*/
#include "bsp/motor/bsp_uln2003.h"

/* 私有类型定义 --------------------------------------------------------------*/
/* 私有宏定义 ----------------------------------------------------------------*/
/* 私有变量 ------------------------------------------------------------------*/
/* 扩展变量 ------------------------------------------------------------------*/
/* 私有函数原形 --------------------------------------------------------------*/
/* 函数体 --------------------------------------------------------------------*/

/**
  * 函数功能: 板载ULN2003 IO引脚初始化.
  * 输入参数: 无
  * 返 回 值: 无
  * 说    明：使用宏定义方法代替具体引脚号，方便程序移植，只要简单修bsp_uln2003.h
  *           文件相关宏定义就可以方便修改引脚。
  */
void ULN2003_GPIO_Init(void)
{
   /* 定义IO硬件初始化结构体变量 */
  GPIO_InitTypeDef GPIO_InitStructure;
	
	/* 使能引脚对应IO端口时钟 */  
  ULN2003_RCC_CLOCKCMD(ULN2003_RCC_CLOCKGPIO, ENABLE);

  /* 设定对应引脚IO编号 */
  GPIO_InitStructure.GPIO_Pin = ULN2003_GPIO_PIN;  
  /* 设定引脚IO最大操作速度 ：GPIO_Speed_50MHz */
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;  
  /* 设定引脚IO为输出模式 */
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;  
  /* 初始化引脚IO */
  GPIO_Init(ULN2003_GPIO, &GPIO_InitStructure);  
  
  GPIO_ResetBits(ULN2003_GPIO,ULN2003_GPIO_PIN);
}


/******************* (C) COPYRIGHT 2015-2020 硬石嵌入式开发团队 *****END OF FILE****/
