/**
  ******************************************************************************
  * 文件名程: main.c 
  * 作    者: 硬石嵌入式开发团队
  * 版    本: V1.1
  * 编写日期: 2017-04-27
  * 功    能: 具有梯形加减速的步进电机控制
  ******************************************************************************
  * 说明：
  * 本例程配套硬石stm32开发板YS-F1Pro使用。
  * 
  * 淘宝：
  * 论坛：http://www.ing10bbs.com
  * 版权归硬石嵌入式开发团队所有，请勿商用。
  ******************************************************************************
  */
/* 包含头文件 ----------------------------------------------------------------*/
#include "stm32f10x.h"
#include "stdio.h"
#include "stdlib.h"
#include "bsp/key/bsp_key.h"
#include "bsp/StepMotor/bsp_TB6600_TIM.h"

/* 私有类型定义 --------------------------------------------------------------*/
/* 私有宏定义 ----------------------------------------------------------------*/
/* 私有变量 ------------------------------------------------------------------*/
uint32_t set_speed  = 50;       // 速度

/* 扩展变量 ------------------------------------------------------------------*/
/* 私有函数原形 --------------------------------------------------------------*/
/* 函数体 --------------------------------------------------------------------*/

/**
  * 函数功能: 主函数.
  * 输入参数: 无
  * 返 回 值: 无
  * 说    明: 无
  */
int main(void)
{
  KEY_GPIO_Init();
  StepMotor_TIMx_Init();
  AXIS_TIMx->BDTR = TIM_BDTR_MOE;//使能高级定时器的输出
  /* 无限循环 */
  while (1)    
  {
    LimitDetect();
		AxisHome();
    if(KEY1_StateRead()==KEY_DOWN)
    {
      AxisMoveRel(0x57FFF*ZeroDir, accel, decel, set_speed);	
    }
  }
}

/******************* (C) COPYRIGHT 2015-2020 硬石嵌入式开发团队 *****END OF FILE****/
